package com.pchome.hadoopdmp.mapreduce.job.dmplog;

public enum EnumAccountIndustry {
	
	政府機關("政府機關","1001000000"),
	公用事業("公用事業","1002000000"),
	食品餐飲("食品餐飲","1003000000"),
	衣著配件("衣著配件","1004000000"),
	住屋居家("住屋居家","1005000000"),
	行車運輸("行車運輸","1006000000"),
	育才學術("育才學術","1007000000"),
	樂在休閒("樂在休閒","1008000000"),
	百貨購物("百貨購物","1009000000"),
	醫療保健("醫療保健","1010000000"),
	環境保護("環境保護","1011000000"),
	社會服務("社會服務","1012000000"),
	新聞文化("新聞文化","1013000000"),
	金融工商("金融工商","1014000000"),
	廣告印刷("廣告印刷","10151000000"),
	事務文具("事務文具","1016000000"),
	聲光影視("聲光影視","1017000000"),
	家用電器("家用電器","1018000000"),
	電工器材("電工器材","1019000000"),
	資訊通信("資訊通信","1020000000"),
	農林漁牧("農林漁牧","1021000000"),
	紡織工業("紡織工業","1022000000"),
	化學工業("化學工業","1023000000"),
	工業機械("工業機械","1024000000"),
	金屬工業("金屬工業","1025000000"),
	包裝服務("包裝服務","1026000000"),
	生命禮儀("生命禮儀","1027000000");
	
	private final String name;
	private final String value;
	
	private EnumAccountIndustry (String name, String value){
		this.name = name;
		this.value = value;
	}
	
	public String getName() {
		return name;
	}

	public String getValue() {
		return value;
	}
	
}
